let handler = async (m, { conn, args }) => {
    let userId = m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.sender
    let user = global.db.data.users[userId]
    let img = 'https://files.catbox.moe/7m1fbp.jpg'
    let name = conn.getName(userId)
    let txt = `
Hola @${userId.split('@')[0]} aqui esta el menu owner

> ᥴ᥆mᥲᥒძ᥆s ძᥱ m᥆ძᥱrᥲᥴіóᥒ ᥡ ᥴ᥆ᥒ𝗍r᥆ᥣ ᥲ᥎ᥲᥒzᥲძ᥆ ⍴ᥲrᥲ ᥆ᥕᥒᥱrs.

ᰔᩚ *#α∂∂οωиєя • #∂єℓοωиєя*
> ✦ αgяєgα ο єℓιмιиα υи иúмєяο ∂є ℓα ℓιѕτα ∂є οωиєяѕ.
ᰔᩚ *#ϲο∂ιgο*
> ✦ ϲяєα υи τοκєи ο ϲó∂ιgο ∂є ϲαиנєó ∂є ϲó∂ιgοѕ.
ᰔᩚ *#ϐαϲκυρ • #ϲορια*
> ✦ ϲяєαя υи яєѕραℓ∂ο ∂є ѕєgυяι∂α∂ ∂є ℓα *∂ϐ* ∂єℓ ϐοτ.
ᰔᩚ *#ϐϲgϲ*
> ✦ єиνια υи мєиѕαנє α το∂οѕ ℓοѕ gяυροѕ ∂οи∂є єѕτє єℓ ϐοτ.
ᰔᩚ *#ϲℓєαиƒιℓєѕ*
> ✦ єℓιмιиα αяϲнινοѕ τємροяαℓєѕ.
ᰔᩚ *#α∂∂ϲοιиѕ • #αñα∂ιяϲοιи*
> ✦ αñα∂є ϲοιиѕ α υи υѕυαяιο.
ᰔᩚ *#υѕєяρяємιυм • #α∂∂ρяєм*
> ✦ οτοяgαя ρяємιυм α υи υѕυαяιο.
ᰔᩚ *#∂єℓρяєм #яємονє*
> ✦ գυιταя ρяємιυм α υи υѕυαяιο.
ᰔᩚ *#α∂∂єϰρ • #αñα∂ιяϰρ*
> ✦ αñα∂є ϰρ α υи υѕυαяιο.
ᰔᩚ *#αυτοα∂мιи*
> ✦ єℓ ϐοτ ∂αяα α∂мιи αυτοмáτιϲαмєиτє ѕοℓο ѕι єℓ ϐοτ єѕ α∂мιи.
ᰔᩚ *#ℓιѕτϐαи • #ϐαиℓιѕτ*
> ✦ ℓιѕτα ∂є υѕυαяιοѕ γ ϲнατѕ ϐαиєα∂οѕ.
ᰔᩚ *#ϐαиυѕєя*
> ✦ ϐαиєαя α υи υѕυαяιο.
ᰔᩚ *#υиϐαиυѕєя*
> ✦ ∂єѕϐαиєαя α υи υѕυαяιο.
ᰔᩚ *#∂ѕοωиєя • #∂єℓαι*
> ✦ єℓιмιиα αяϲнινοѕ ιииєϲєѕαяιοѕ ∂є ѕєѕιóи.
ᰔᩚ *#ϲℓєαяτмρ • #ναϲιαяτмρ*
> ✦ єℓιмιиα αяϲнινο ιииєϲєѕαяιοѕ ∂є ℓα ϲαяρєτα τмρ.
ᰔᩚ *#ϐℓοϲκ • #υиϐℓοϲκ*
> ✦ ϐℓοգυєαя ο ∂єѕϐℓοգυєαя α υи υѕυαяιο ∂єℓ иúмєяο ∂єℓ ϐοτ.
ᰔᩚ *#ℓιѕτϐℓοϲκ • #ϐℓοϲκℓιѕτ*
> ✦ νєя ℓιѕτα∂ο ∂є υѕυαяιοѕ ϐℓοգυєα∂οѕ.
ᰔᩚ *#яємονєϲοιи • #գυιταяϲοιи*
> ✦ գυιταя ϲοιиѕ α υи υѕυαяιο.
ᰔᩚ *#∂єℓєτє∂αταυѕєя • #яєѕєτυѕєя*
> ✦ яєѕταϐℓєϲєя ℓοѕ ∂ατοѕ ∂є υи υѕυαяιο.
ᰔᩚ *#яємονєϰρ • #գυιταяϰρ*
> ✦ գυιταя ϰρ α υи υѕυαяιο.
ᰔᩚ *#иєωgϲ #ϲяєαяgϲ*
> ✦ ϲяєα υи иυєνο gяυρο ∂єѕ∂є єℓ иúмєяο ∂єℓ ϐοτ.
ᰔᩚ *#∂єℓєτєƒιℓє*
> ✦ єℓιмιиα αяϲнινοѕ ∂єℓ ϐοτ
ᰔᩚ *#gєτ • #ƒєτϲн*
> ✦ νєя єℓ єѕτα∂ο ∂є υиα ρágιиα ωєϐ.
ᰔᩚ *#ρℓυgιи • #gєτρℓυgιи*
> ✦ єϰτяαєя υи ρℓυgιи ∂є ℓοѕ αяϲнινοѕ ∂єℓ ϐοτ.
ᰔᩚ *#gяουρℓιѕτ • #ℓιѕτgяουρ*
> ✦ νєя ℓιѕτα∂ο ∂є gяυροѕ єи ℓοѕ գυє єѕτá υиι∂ο єℓ ϐοτ.
ᰔᩚ *#נοιи • #ιиνιτє*
> ✦ αgяєgαя єℓ ϐοτ α υи gяυρο мє∂ιαиτє єℓ єиℓαϲє ∂є ιиνιταϲιóи.
ᰔᩚ *#ℓєανє • #ѕαℓιя*
> ✦ ѕαϲαя єℓ ϐοτ ∂є υи gяυρο.
ᰔᩚ *#ℓєτ*
> ✦ єиνια υи мєиѕαנє ϲοи υиα ∂υяαϲιóи ∂є 1 нοяα.
ᰔᩚ *#ρяєƒιϰ*
> ✦ νєя ο ϲαмϐιαя єℓ ρяєƒιנο ∂єℓ ϐοτ.
ᰔᩚ *#яєѕєτρяєƒιϰ*
> ✦ яєѕταϐℓєϲєя єℓ ρяєƒιנο ∂єℓ ϐοτ.
ᰔᩚ *#яєιиιϲιαя • #яєѕταяτ*
> ✦ яєιиιϲιαя єℓ ѕєяνι∂οя ∂єℓ ϐοτ.
ᰔᩚ *#яєυиιοи • #мєєτιиg*
> ✦ єиνια υи ανιѕο ∂є яєυиιóи α ℓοѕ οωиєяѕ.
ᰔᩚ *#ѕανєנѕ • #ѕανєƒιℓє*
> ✦ gυαя∂α υи αяϲнινο єи υиα ∂є ℓαѕ яυταѕ ∂єℓ ϐοτ.
ᰔᩚ *#ѕανєρℓυgιи*
> ✦ gυαя∂α υи ρℓυgιи єи ℓα ϲαяρєτα ∂є ϲοмαи∂οѕ ∂єℓ ϐοτ.
ᰔᩚ *#ѕєτϐαииєя*
> ✦ ϲαмϐια ℓα ιмαgєи ∂єℓ мєиυ ρяιиϲιραℓ ∂єℓ ϐοτ.
ᰔᩚ *#ѕєταναταя*
> ✦ ϲαмϐια ℓα ιмαgєи ∂єℓ ϲατáℓοgο.
ᰔᩚ *#α∂∂ϲм∂ • #ѕєτϲм∂*
> ✦ gυαя∂α υи ѕτιϲκєя/ιмαgєи ϲοмο τєϰτο ο ϲοмαи∂ο.
ᰔᩚ *#∂єℓϲм∂*
> ✦ єℓιмιиα єℓ τєϰτο/ϲοмαи∂ο ∂єℓ ϐοτ.
ᰔᩚ *#ϲм∂ℓιѕτ • #ℓιѕτϲм∂*
> ✦ νєя ℓιѕτα∂ο ∂є τєϰτοѕ/ϲοмαи∂οѕ.
ᰔᩚ *#ѕєτιмαgє • #ѕєτρƒρ*
> ✦ ϲαмϐια ℓα ƒοτο ∂єℓ ρєяƒιℓ ∂єℓ ϐοτ.
ᰔᩚ *#ѕєτмοиє∂α*
> ✦ ϲαмϐια ℓα мοиє∂α ∂єℓ ϐοτ.
ᰔᩚ *#ѕєτиαмє*
> ✦ ϲαмϐια єℓ иοмϐяє ∂єℓ ϐοτ
ᰔᩚ *#ѕєτϐιο • #ѕєτѕτατυѕ*
> ✦ ϲαмϐια ℓα ϐιοgяαƒíα ∂єℓ ϐοτ.
ᰔᩚ *#υρ∂ατє*
> ✦ αϲτυαℓιzα єℓ ϐοτ α ℓα νєяѕιóи мáѕ яєϲιєиτє ∂є gιτнυϐ.
`.trim()

  await conn.sendMessage(m.chat, { 
      text: txt,
      contextInfo: {
          mentionedJid: [m.sender, userId],
          isForwarded: true,
          forwardedNewsletterMessageInfo: {
              newsletterJid: channelRD.id,
              newsletterName: channelRD.name,
              serverMessageId: -1,
          },
          forwardingScore: 999,
          externalAdReply: {
              title: botname,
              body: textbot,
              thumbnailUrl: img,
              sourceUrl: redes,
              mediaType: 1,
              showAdAttribution: true,
              renderLargerThumbnail: true,
          },
      },
  }, { quoted: m })

}

handler.help = ['dev']
handler.tags = ['main']
handler.command = ['dev', 'owners']

export default handler
